; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v8 - type_1 ?v1 - type_2)
 	      (pred_2 ?v7 - object ?v1 - type_2)
	      (pred_3 ?v8 - type_1 ?v3 - type_3)
	      (pred_4 ?v8 - type_1 ?v7 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v8 - type_1 ?v6 ?v5 - type_2)
       :precondition (and  (pred_1 ?v8 ?v6))
       :effect (and  (pred_1 ?v8 ?v5)
		     (not (pred_1 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_1 ?v4 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v2) (pred_1 ?v8 ?v2) (pred_3 ?v8 ?v3))
       :effect (and (pred_4 ?v8 ?v4 ?v3)
		    (not (pred_2 ?v4 ?v2)) 
		    (not (pred_3 ?v8 ?v3))))

   (:action op_2
       :parameters (?v8 - type_1 ?v4 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v4 ?v3) (pred_1 ?v8 ?v2))
       :effect (and (pred_2 ?v4 ?v2)
		    (pred_3 ?v8 ?v3)
		    (not (pred_4 ?v8 ?v4 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_01 - type_1
obj_10 obj_09 obj_11 obj_05 - type_3
obj_07 obj_08 obj_02 - type_2
obj_12 obj_06 obj_03 - object)
(:init
(pred_1 obj_04 obj_08)
(pred_3 obj_04 obj_10)
(pred_3 obj_04 obj_09)
(pred_1 obj_01 obj_02)
(pred_3 obj_01 obj_11)
(pred_3 obj_01 obj_05)
(pred_2 obj_12 obj_07)
(pred_2 obj_06 obj_07)
(pred_2 obj_03 obj_08)
)
(:goal
(and
(pred_2 obj_12 obj_07)
(pred_2 obj_06 obj_02)
(pred_2 obj_03 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_04 obj_02) (pred_1 obj_01 obj_02))))
  )
)
)

; plan
1. (op_3 obj_04 obj_08 obj_07)
   deleted: (pred_1 obj_04 obj_08)
   added: (pred_1 obj_04 obj_07)
   goals met: 2 of 3
2. (op_3 obj_01 obj_02 obj_07)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_07)
   goals met: 2 of 3
3. (op_1 obj_04 obj_06 obj_07 obj_09)
   deleted: (pred_2 obj_06 obj_07) (pred_3 obj_04 obj_09)
   added: (pred_4 obj_04 obj_06 obj_09)
   goals met: 2 of 3
4. (op_3 obj_04 obj_07 obj_02)
   deleted: (pred_1 obj_04 obj_07)
   added: (pred_1 obj_04 obj_02)
   goals met: 2 of 3
5. (op_2 obj_04 obj_06 obj_02 obj_09)
   deleted: (pred_4 obj_04 obj_06 obj_09)
   added: (pred_2 obj_06 obj_02) (pred_3 obj_04 obj_09)
   goals met: 3 of 3
